[
    {
        "id" : "1",
        "text" : "So I've recently started getting deeper into lotr lore after watching the movies. I wanted to ask, they say that mithril is one of the strongest metals and whatnot, I always wondered if Fingolfin had worn mithril during his battle with Morgoth, would he have survived or maybe last longer to injure him further. I know that morgoth is a valar and holds immense power but would mithril have helped or would it have made no difference.",
        "userName" : "Background-Eagle702",
        "upvotes" : "33",
        "comments" : "6",
        "category" : "lore"
    },
    {
        "id" : "2",
        "text" : "Ulmo, Lord of Waters knows what goes on in Middle Earth because water runs in all the veins of the earth. So Isildur gets ambushed and killed and loses his ring in the river, where it sat for a long time. During all that time, Ulmo knew but did nothing?",
        "userName" : "SpirituallyMyopic",
        "upvotes" : "422",
        "comments" : "8",
        "category" : "Question"
    },
    {
        "id" : "3",
        "text" : "What exactly made the Tooks so unusual among hobbits?",
        "userName" : "RomanGallas",
        "upvotes" : "15",
        "comments" : "5",
        "category" : "Question"
    },
    {
        "id" : "4",
        "text" : "What if the Fellowship of the Ring had not been broken?",
        "userName" : "Andre_BR_RJ",
        "upvotes" : "143",
        "comments" : "6",
        "category" : "AlternativePlot"
    },
    {
        "id" : "5",
        "text" : "If Aragorn had the foresight to specify that the Army of the Dead would be needed for two battles, do you think the dead combined with the Men of the West could have made a good go of taking on the orcs at the gate to Mordor?Surely it would have at least helped keep Sauron that much more focused on his front gate",
        "userName" : "RabbiValas",
        "upvotes" : "25",
        "comments" : "9",
        "category" : "Question"
    },
    {
        "id" : "6",
        "text" : "Anyone else think the dwarves setting up their shield wall looks awesome? Just how quickly and efficiently they do it too.",
        "userName" : "Background-Eagle702",
        "upvotes" : "26",
        "comments" : "0",
        "category" : "Opinion"
    },
    {
        "id" : "7",
        "text" : ""Come forth my Armies" ! Just that scene and the sound of the horn gives me goosebumps! Best movie no cap!",
        "userName" : "RomanGallas",
        "upvotes" : "206",
        "comments" : "0",
        "category" : "General"
    },
    {
        "id" : "8",
        "text" : "This scene is one of those scenes that just stays in your memory, forever. Masterpiece",
        "userName" : "Andre_BR_RJ",
        "upvotes" : "157",
        "comments" : "5",
        "category" : "General"
    },
    {
        "id" : "9",
        "text" : "Imagine living for thousands of years and dying by being rammed by a goat with a short hairy person riding it. Glorious.",
        "userName" : "SpirituallyMyopic",
        "upvotes" : "35",
        "comments" : "9",
        "category" : "AlternativePlot"
    },
    {
        "id" : "10",
        "text" : "it's from 3:25 (https://www.youtube.com/watch?v=_kvjKaTqX4c&t=205s) to the end that you realise how effective and deadly an elven/dwarven alliance would be.",
        "userName" : "RabbiValas",
        "upvotes" : "10",
        "comments" : "0",
        "category" : "General"
    },
    {
        "id" : "11",
        "text" : "What If Faramir Had Taken The One Ring From Frodo?",
        "userName" : "Background-Eagle702",
        "upvotes" : "1",
        "comments" : "0",
        "category" : "AlternativePlot"
    },
    {
        "id" : "12",
        "text" : "What If Lord Of The Rings Was All Dogs? ",
        "userName" : "Andre_BR_RJ",
        "upvotes" : "10",
        "comments" : "5",
        "category" : "AlternativePlot"
    },
]
